import sqlite3 as sql

db_sub = sql.connect('database/subjects.db')
cur_sub = db_sub.cursor()

subjects = {
    'monday': {
        'title': 'Понедельник',
        'subjects': {
            '1': 'Разговоры о важном',
            '2': 'Геометрия',
            '3': 'Алгебра',
            '4': 'Литер',
            '5': 'Общество',
            '6': 'ОБЖ'
        },
        'cabines': {
            '1':'216',
            '2':'216',
            '3':'216',
            '4':'206',
            '5':'205',
            '6':'315'
        }
    },
    'tuesday': {
        'title': 'Вторник',
        'subjects': {
            '1': 'Эл. физика',
            '2': 'История',
            '3': 'Информатика',
            '4': 'Информатика',
            '5': 'Англ.яз',
            '6': 'Англ.яз'
        },
        'cabines': {
            '1':'210',
            '2':'205',
            '3':'218',
            '4':'218',
            '5':'115',
            '6':'115'
        }
    },
    'wednesday': {
        'title': 'Среда',
        'subjects': {
            '1': 'Физ-ра',
            '2': 'Русс.яз',
            '3': 'Литер',
            '4': 'Геометрия',
            '5': 'Инд.проект',
            '6': 'Родн.лит'
        },
        'cabines': {
            '1':'219',
            '2':'206',
            '3':'206',
            '4':'216',
            '5':'216',
            '6':'317'
        }
    },
    'thursday': {
        'title': 'Четверг',
        'subjects': {
            '1': 'Физ-ра',
            '2': 'Химия',
            '3': 'Геометрия',
            '4': 'Англ.яз',
            '5': 'Информатика',
            '6': 'Кл.час',
            '7': 'Физика'
        },
        'cabines': {
            '1':'219',
            '2':'310',
            '3':'216',
            '4':'115',
            '5':'218',
            '6':'216',
            '7': '210'
        }
    },
    'friday': {
        'title': 'Пятница',
        'subjects': {
            '1': 'Алгебра',
            '2': 'История',
            '3': 'География',
            '4': 'Рус.яз',
            '5': 'Биология',
            '6': 'Эл.физика',
            '7': 'Акт.вопр биология'
        },
        'cabines': {
            '1':'216',
            '2':'105',
            '3':'212',
            '4':'315',
            '5':'312',
            '6':'210',
            '7': '311'
        }
    },
    'saturday': {
        'title': 'Суббота',
        'subjects': {
            '1': 'Информатика',
            '2': 'Общество',
            '3': 'Алгебра',
            '4': 'Вероятность',
            '5': 'Физика',
            '6': 'Родн.яз',
            '7': 'Кл.час'
        },
        'cabines': {
            '1':'218',
            '2':'216',
            '3':'216',
            '4':'205',
            '5':'210',
            '6':'318',
            '7': '216'
        }
    }
}

async def return_schedule(schedule):
    monday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Понедельник"').fetchall()
    tuesday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Вторник"').fetchall()
    wednesday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Среда"').fetchall()
    thursday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Четверг"').fetchall()
    friday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Пятница"').fetchall()
    saturday = cur_sub.execute('SELECT title, subjects, cabines FROM subjects_10t_1 WHERE title="Суббота"').fetchall()
    if schedule == 'full':
        full_schedule_first = (                         f'═────<b>{monday[0][0]}</b>────═'
                                                    '\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {monday[0][1]}  <b>{monday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {monday[1][1]}  <b>{monday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {monday[2][1]}  <b>{monday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {monday[3][1]}  <b>{monday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {monday[4][1]}  <b>{monday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {monday[5][1]}  <b>{monday[5][2]}</b>'
                                                    '\n————————————————————'
                                                    f'\n═────<b>{tuesday[0][0]}</b>────═'
                                                    '\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {tuesday[0][1]}  <b>{tuesday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {tuesday[1][1]}  <b>{tuesday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {tuesday[2][1]}  <b>{tuesday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {tuesday[3][1]}  <b>{tuesday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {tuesday[4][1]}  <b>{tuesday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {tuesday[5][1]}  <b>{tuesday[5][2]}</b>'
                                                    '\n————————————————————'
                                                    f'\n═────<b>{wednesday[0][0]}</b>────═'
                                                    '\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {wednesday[0][1]}  <b>{wednesday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {wednesday[1][1]}  <b>{wednesday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {wednesday[2][1]}  <b>{wednesday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {wednesday[3][1]}  <b>{wednesday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {wednesday[4][1]}  <b>{wednesday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {wednesday[5][1]}  <b>{wednesday[5][2]}</b>'
                                                    '\n————————————————————'
                                                    f'\n═────<b>{thursday[0][0]}</b>────═'
                                                    '\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {thursday[0][1]}  <b>{thursday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {thursday[1][1]}  <b>{thursday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {thursday[2][1]}  <b>{thursday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {thursday[3][1]}  <b>{thursday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {thursday[4][1]}  <b>{thursday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {thursday[5][1]}  <b>{thursday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {thursday[6][1]}  <b>{thursday[6][2]}</b>'
                                                    '\n————————————————————'
                                                    f'\n═────<b>{friday[0][0]}</b>────═'
                                                    '\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {friday[0][1]}  <b>{friday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {friday[1][1]}  <b>{friday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {friday[2][1]}  <b>{friday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {friday[3][1]}  <b>{friday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {friday[4][1]}  <b>{friday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {friday[5][1]}  <b>{friday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {friday[6][1]}  <b>{friday[6][2]}</b>'
                                                    '\n————————————————————'
                                                    f'\n═────<b>{saturday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {saturday[0][1]}  <b>{saturday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {saturday[1][1]}  <b>{saturday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {saturday[2][1]}  <b>{saturday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {saturday[3][1]}  <b>{saturday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {saturday[4][1]}  <b>{saturday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {saturday[5][1]}  <b>{saturday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {saturday[6][1]}  <b>{saturday[6][2]}</b>'
                                                    '\n————————————————————')
        return full_schedule_first
    if schedule == 'monday':
        monday = (f'═────<b>{monday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {monday[0][1]}  <b>{monday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {monday[1][1]}  <b>{monday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {monday[2][1]}  <b>{monday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {monday[3][1]}  <b>{monday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {monday[4][1]}  <b>{monday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {monday[5][1]}  <b>{monday[5][2]}</b>'
                                                    f'\n————————————————————')
        return monday
    if schedule == 'tuesday':
        tuesday_first = (f'\n═────<b>{tuesday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {tuesday[0][1]}  <b>{tuesday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {tuesday[1][1]}  <b>{tuesday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {tuesday[2][1]}  <b>{tuesday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {tuesday[3][1]}  <b>{tuesday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {tuesday[4][1]}  <b>{tuesday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {tuesday[5][1]}  <b>{tuesday[5][2]}</b>'
                                                    f'\n————————————————————')
        return tuesday_first
    if schedule == 'wednesday':
        wednesday_first = (f'\n═────<b>{wednesday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {wednesday[0][1]}  <b>{wednesday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {wednesday[1][1]}  <b>{wednesday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {wednesday[2][1]}  <b>{wednesday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {wednesday[3][1]}  <b>{wednesday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {wednesday[4][1]}  <b>{wednesday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {wednesday[5][1]}  <b>{wednesday[5][2]}</b>'
                                                    f'\n————————————————————')
        return wednesday_first
    if schedule == 'thursday':
        thursday_first = (f'\n═────<b>{thursday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {thursday[0][1]}  <b>{thursday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {thursday[1][1]}  <b>{thursday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {thursday[2][1]}  <b>{thursday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {thursday[3][1]}  <b>{thursday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {thursday[4][1]}  <b>{thursday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {thursday[5][1]}  <b>{thursday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {thursday[6][1]}  <b>{thursday[6][2]}</b>'
                                                    f'\n————————————————————')
        return thursday_first
    if schedule == 'friday':
        friday = (f'\n═────<b>{friday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {friday[0][1]}  <b>{friday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {friday[1][1]}  <b>{friday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {friday[2][1]}  <b>{friday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {friday[3][1]}  <b>{friday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {friday[4][1]}  <b>{friday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {friday[5][1]}  <b>{friday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {friday[6][1]}  <b>{friday[6][2]}</b>'
                                                    f'\n————————————————————')
        return friday
    if schedule == 'saturday':
        saturday_first = (f'\n═────<b>{saturday[0][0]}</b>────═'
                                                    f'\n————————————————————'
                                                    f'\n<b>1</b> |⌛️<i>08:00-08:40</i> {saturday[0][1]}  <b>{saturday[0][2]}</b>'
                                                    f'\n<b>2</b> |⌛️<i>08:50-09:30</i> {saturday[1][1]}  <b>{saturday[1][2]}</b>'
                                                    f'\n<b>3</b> |⌛️<i>09:40-10:20</i> {saturday[2][1]}  <b>{saturday[2][2]}</b>'
                                                    f'\n<b>4</b> |⌛️<i>10:40-11:20</i> {saturday[3][1]}  <b>{saturday[3][2]}</b>'
                                                    f'\n<b>5</b> |⌛️<i>11:40-12:20</i> {saturday[4][1]}  <b>{saturday[4][2]}</b>'
                                                    f'\n<b>6</b> |⌛️<i>12:25-13:05</i> {saturday[5][1]}  <b>{saturday[5][2]}</b>'
                                                    f'\n<b>7</b> |⌛️<i>13:10-13:50</i> {saturday[6][1]}  <b>{saturday[6][2]}</b>'
                                                    f'\n————————————————————')
        return saturday_first        

uchitelya = ('Список учителей:'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Английский язык (1 группа)</b>'
             '\n<code>Егорова Ксения Викторовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Английский язык (2 группа)</b>'
             '\n<code>Шарафутдинова Эльвира Рафисовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Алгебра, геометрия</b>'
             '\n<code>Ахмадуллина Лилия Фаритовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Физика</b>'
             '\n<code>Каюмова Гулюса Шавкатовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>История</b>'
             '\n<code>Валиев Ильмар Ильдарович</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Обществознание</b>'
             '\n<code>Галиева Иркэ Юрьевна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Химия</b>'
             '\n<code>Закирова Энже Жамильевна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Биология</b>'
             '\n<code>Буранова Зульфия Валерьевна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Русский язык, литература</b>'
             '\n<code>Хамитова Эльмира Мансуровна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Информатика</b>'
             '\n<code>Нестерова Лилия Вячеславовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Основы безопасности жизнедеятельности</b>'
             '\n<code>Андреева Светлана Германовна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Татарский язык (1 группа)</b>'
             '\n<code>Хуснутдинова Альбина Анваровна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Татарский язык (2 группа)</b>'
             '\n<code>Тимерова Альбина Наилевна</code>'
             '\n-------------------------------------------'
             '\n👨‍🏫 <b>Физкультура</b>'
             '\n<code>Крымов Николай Евгеневич</code>'
             '\n-------------------------------------------'
             )
cheliki = ('<b>Список учеников</b>'
           '\n\n1. Абдуллин Артур'
           '\n2. Абдульменов Ратмир'
           '\n3. Асеинова Зарема'
           '\n4. Бердникова Василина'
           '\n5. Бикмуллин Тимур'
           '\n6. Богданова Анна'
           '\n7. Буранова Амира'
           '\n8. Вострова Эльвина'
           '\n9. Галиев Альмир'
           '\n10. Галиева Азалия'
           '\n11. Гарипов Адель'
           '\n12. Гатауллина Лейсан'
           '\n13. Егоров Дамил'
           '\n14. Ерохин Егор'
           '\n15. Загреева Зарина'
           '\n16. Исламова Дана'
           '\n17. Карасев Тимур'
           '\n18. Кафиятуллов Камиль'
           '\n19. Мифтахова Сафира'
           '\n20. Музипова Альбина'
           '\n21. Мухаметзянов Тимур'
           '\n22. Нигъматуллина Айзиля'
           '\n23. <code>Нурисламов Амир</code>'
           '\n24. Сайфетдинова Диляра'
           '\n25. Сафин Алмаз'
           '\n26. Сафиуллин Эмиль'
           '\n27. Сахабутдинов Дамир'
           '\n28. Хабибуллин Ринат'
           '\n29. Хакимов Ильназ'
           '\n30. Хасанова Айгуль'
           '\n31. Хуснутдинова Зарина'
           '\n32. Шакирова Ильвина'
           '\n33. Шарафеева Алина'
           '\n34. Шарафутдинов Даниил'
           '\n35. Щепачева Милена')
